Revit 2027 API
BuiltInFailures.SplineFailures Class
 Failures about Spline.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.SplineFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SplineFailures
Public NotInheritable Class SplineFailures
public ref class SplineFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SplineFailures = class end
The BuiltInFailures.SplineFailures type exposes the following members.
Properties
Name | Description
CannotCreateSpline |  Can't make Spline.
ClosedSpline |  Closed or self-intersecting splines are not allowed.
Top
See Also
Reference
Autodesk.Revit.DB Namespace